export default defineTopic({
    title: 'Прямой перебор',
    description: `
        Простой, безотказный способ решать задачи по комбинаторике.
        Вы освоите правила прямого перебора, при помощи которых можно перебирать комбинации так, чтобы не запутаться, посчитать всё и не учесть лишнего.
        Так же вы изучите универсальный способ применения правила перебора — построение дерева вариантов.
    `,
    flags: {
        secondary: true,
        advanced: true,
    },
    dependencies: [
        {
            dependency: $CONTENT.combinatorics.basics.whatIsCombinatorics,
            reason: 'Там есть важный момент про отброс смысла комбинаций!',
        },
    ],
});
