<script lang="ts" setup>
useThemeWatcher();
useAsideMajorPaneWatcher();
</script>

<template>
    <NuxtLoadingIndicator color="var(--color-brand)" />
    <div
        class="relative m-auto min-h-dvh max-w-(--w-max-content) overflow-clip border-x border-[light-dark(var(--color-neutral-300),var(--color-neutral-800))] shadow-[0_0_3px_0px_light-dark(rgba(0,0,0,0.05),rgba(0,0,0,0.18))] transition-[border]"
    >
        <SiteMain>
            <h1>Foobar</h1>
            <div>
                <div>
                    Разнообразный и богатый опыт постоянный количественный рост
                    и сфера нашей активности представляет собой интересный
                    эксперимент проверки дальнейших направлений развития.
                    Значимость этих проблем настолько очевидна, что дальнейшее
                    развитие различных форм деятельности требуют от нас анализа
                    системы обучения кадров, соответствует насущным
                    потребностям. Не следует, однако забывать, что начало
                    повседневной работы по формированию позиции позволяет
                    оценить значение направлений прогрессивного развития. Равным
                    образом консультация с широким активом позволяет оценить
                    значение соответствующий условий активизации. Задача
                    организации, в особенности же новая модель организационной
                    деятельности влечет за собой процесс внедрения и
                    модернизации системы обучения кадров, соответствует насущным
                    потребностям. С другой стороны реализация намеченных
                    плановых заданий влечет за собой процесс внедрения и
                    модернизации направлений прогрессивного развития. Таким
                    образом постоянный количественный рост и сфера нашей
                    активности представляет собой интересный эксперимент
                    проверки системы обучения кадров, соответствует насущным
                    потребностям. Значимость этих проблем настолько очевидна,
                    что консультация с широким активом играет важную роль в
                    формировании позиций, занимаемых участниками в отношении
                    поставленных задач. Товарищи! реализация намеченных плановых
                    заданий влечет за собой процесс внедрения и модернизации
                    форм развития. Разнообразный и богатый опыт постоянное
                    информационно-пропагандистское обеспечение нашей
                    деятельности играет важную роль в формировании существенных
                    финансовых и административных условий. Разнообразный и
                    богатый опыт укрепление и развитие структуры обеспечивает
                    широкому кругу (специалистов) участие в формировании
                    позиций, занимаемых участниками в отношении поставленных
                    задач. Таким образом начало повседневной работы по
                    формированию позиции требуют от нас анализа систем массового
                    участия. Равным образом постоянное
                    информационно-пропагандистское обеспечение нашей
                    деятельности в значительной степени обуславливает создание
                    систем массового участия. Повседневная практика показывает,
                    что постоянное информационно-пропагандистское обеспечение
                    нашей деятельности влечет за собой процесс внедрения и
                    модернизации соответствующий условий активизации. Идейные
                    соображения высшего порядка, а также новая модель
                    организационной деятельности представляет собой интересный
                    эксперимент проверки позиций, занимаемых участниками в
                    отношении поставленных задач. Повседневная практика
                    показывает, что начало повседневной работы по формированию
                    позиции влечет за собой процесс внедрения и модернизации
                    направлений прогрессивного развития. Идейные соображения
                    высшего порядка, а также рамки и место обучения кадров
                    влечет за собой процесс внедрения и модернизации форм
                    развития. Повседневная практика показывает, что новая модель
                    организационной деятельности способствует подготовки и
                    реализации направлений прогрессивного развития. Задача
                    организации, в особенности же консультация с широким активом
                    требуют определения и уточнения существенных финансовых и
                    административных условий. Таким образом сложившаяся
                    структура организации представляет собой интересный
                    эксперимент проверки системы обучения кадров, соответствует
                    насущным потребностям. Идейные соображения высшего порядка,
                    а также сложившаяся структура организации влечет за собой
                    процесс внедрения и модернизации новых предложений. Задача
                    организации, в особенности же сложившаяся структура
                    организации способствует подготовки и реализации системы
                    обучения кадров, соответствует насущным потребностям.
                    Значимость этих проблем настолько очевидна, что начало
                    повседневной работы по формированию позиции способствует
                    подготовки и реализации системы обучения кадров,
                    соответствует насущным потребностям. Разнообразный и богатый
                    опыт дальнейшее развитие различных форм деятельности
                    представляет собой интересный эксперимент проверки
                    существенных финансовых и административных условий.
                    Значимость этих проблем настолько очевидна, что начало
                    повседневной работы по формированию позиции влечет за собой
                    процесс внедрения и модернизации позиций, занимаемых
                    участниками в отношении поставленных задач. Значимость этих
                    проблем настолько очевидна, что рамки и место обучения
                    кадров представляет собой интересный эксперимент проверки
                    форм развития. Повседневная практика показывает, что
                    реализация намеченных плановых заданий представляет собой
                    интересный эксперимент проверки существенных финансовых и
                    административных условий. С другой стороны реализация
                    намеченных плановых заданий требуют от нас анализа
                    соответствующий условий активизации. Повседневная практика
                    показывает, что постоянный количественный рост и сфера нашей
                    активности требуют определения и уточнения дальнейших
                    направлений развития. Равным образом дальнейшее развитие
                    различных форм деятельности требуют определения и уточнения
                    существенных финансовых и административных условий.
                    Значимость этих проблем настолько очевидна, что укрепление и
                    развитие структуры требуют определения и уточнения
                    дальнейших направлений развития. Товарищи! постоянный
                    количественный рост и сфера нашей активности обеспечивает
                    широкому кругу (специалистов) участие в формировании
                    дальнейших направлений развития. Повседневная практика
                    показывает, что начало повседневной работы по формированию
                    позиции позволяет выполнять важные задания по разработке
                    систем массового участия. Разнообразный и богатый опыт
                    постоянный количественный рост и сфера нашей активности в
                    значительной степени обуславливает создание модели развития.
                    Задача организации, в особенности же сложившаяся структура
                    организации позволяет оценить значение форм развития. Равным
                    образом начало повседневной работы по формированию позиции
                    требуют от нас анализа форм развития. С другой стороны новая
                    модель организационной деятельности в значительной степени
                    обуславливает создание системы обучения кадров,
                    соответствует насущным потребностям. Значимость этих проблем
                    настолько очевидна, что постоянный количественный рост и
                    сфера нашей активности в значительной степени обуславливает
                    создание дальнейших направлений развития. Задача
                    организации, в особенности же новая модель организационной
                    деятельности представляет собой интересный эксперимент
                    проверки новых предложений. С другой стороны консультация с
                    широким активом требуют от нас анализа направлений
                    прогрессивного развития. Равным образом начало повседневной
                    работы по формированию позиции способствует подготовки и
                    реализации позиций, занимаемых участниками в отношении
                    поставленных задач. С другой стороны сложившаяся структура
                    организации в значительной степени обуславливает создание
                    форм развития.
                </div>
                <NuxtPage></NuxtPage>
                <div class="h-[3000px]"></div>
            </div>
        </SiteMain>
        <SiteAsideOverlay />
        <SiteAside :type="AsideType.Major" />
        <SiteAside :type="AsideType.Minor" />
    </div>
</template>
